
#Область ПрограммныйИнтерфейс
	
// <Определяет полученную форму для корректного программного расположения реквизита>
//
// Параметры:
//  <Форма>  - <Тип.ФормаКлиентскогоПриложения> - <Форма документа, в котром будет программно размещён реквизит>
//
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры // ДополнитьФорму()
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
	
	Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.МГ_КонтактноеЛицо";
	
	КонецПроцедуры
	
	Процедура ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма)
		
		ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.МГ_КонтактноеЛицо";
		
	КонецПроцедуры

#КонецОбласти